ajohnson-smarthome/AJPicoCar/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# Route console to USB Serial JTAG (native USB on XIAO ESP32-C6).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
